{
	"users": [
		{
			"id": "001",
			"login": "komenoryuu",
			"password": "gohanDESU1234",
			"registed_at": "28.10.2024",
			"role_id": 0
		}
	],
	"roles": [
		{
			"id": "0",
			"name": "Администратор"
		},
		{
			"id": "1",
			"name": "Модератор"
		},
		{
			"id": "2",
			"name": "Читатель"
		}
	],
	"posts": [
		{
			"id": "001",
			"title": "Уроки лидерства от Билла Уолша",
			"image_url": "https://fastly.picsum.photos/id/29/384/240.jpg?hmac=iT-Hl5nWUSS0v2Lcn06lO1nnxt7O8SY1TtsZYLac-Fg",
			"content": "Лидерство — ключевой аспект управления любой организацией, особенно когда речь идет о больших компаниях. Именно в таких условиях необходимо проявлять выдающиеся лидерские качества. Билл Уолш, известный американский тренер по американскому футболу и успешный тимлид, активно делился своими мыслями и стратегиями, которые могут значительно улучшить способность к управлению и взаимодействию с командой. В этой статье мы подробно рассмотрим уроки лидерства от Билла Уолша и обсудим, как их можно применить в повседневной работе. Одним из основных уроков, которые можно извлечь из опыта Билла Уолша, является важность понимания собственных ценностей. Уолш всегда акцентировал внимание на том, что каждый лидер должен четко осознавать, какие ценности он привносит в свою команду. Это понимание позволяет не только формулировать ясные цели, но и вдохновлять команду. В современном бизнесе, где постоянная конкуренция влияет на успех, наличие четких ценностей помогает создать уникальную корпоративную культуру. Лидеры, которые понимают и транслируют свои ценности, способны установить доверие среди подчиненных. Это особенно важно для команд, которые сталкиваются с постоянным изменением условий и экономической нестабильностью. Билл Уолш считал, что одним из важных аспектов лидерства является установление четких целей. Он часто подчеркивал, что команда должна иметь ясное понимание того, чего она стремится достичь. Это включает в себя как краткосрочные, так и долгосрочные цели. Ставя цели, важно убедиться, что они являются достигнутыми. Команда должна понимать, какие шаги нужно предпринять для достижения целей, а также иметь возможность отслеживать свой прогресс. Это помогает не только повысить мотивацию, но и устанавливает ответственность за выполнение задач. Кроме того, Уолш подчеркивал необходимость адаптации целей в ответ на изменения в обстановке. Гибкость в подходах и готовность пересматривать приоритеты являются важными качествами успешного лидера.",
			"published_at": "28.10.2024"
		},
		{
			"id": "002",
			"title": "ПМ: Ментальные модели",
			"image_url": "https://fastly.picsum.photos/id/7/384/240.jpg?hmac=32Z4BIe0WIM84UsAxWTKKP1g0EdPUSzLzocrgZfe-JM",
			"content": "Ментальные модели — это простые выражения сложных процессов или отношений. Эти модели можно собирать и использовать для принятия более быстрых и качественных решений. В контексте управления продуктами модель предполагает, что вместо того, чтобы потратить 100% усилий и покрыть 100% желаний клиентов, можно потратить 20% — и удовлетворить 80% желаний. Команды разработчиков постоянно прибегают к этому принципу, и результаты часто выглядят неплохо, когда 20% клиентов с более сложными кейсами не поддерживаются. Ментальные модели могут стать мощным инструментом, но их полезность ограничена контекстами, из которых они экстраполированы. Чтобы преодолеть это ограничение, не полагайтесь на одну или даже несколько моделей — вместо этого нужно постоянно строить сеть ментальных моделей, на которую можно опираться для принятия оптимальных решений.",
			"published_at": "31.10.2024"
		},
		{
			"id": "003",
			"title": "Что такое Wireframing",
			"image_url": "https://fastly.picsum.photos/id/8/384/240.jpg?hmac=gfjP0gbFRffiHzIeNQBE4GNaxDduvQNAaJLgHMOwjUI",
			"content": "Вайрфрейм — это наглядная схема, которая моделирует скелет проекта или технологии. Иногда вайрфрейм называют схемой страниц или экрана, на которой показано, как элементы связаны друг с другом и как они структурированы. Вайрфрейминг — это процесс высшего уровня. UX-дизайнеры часто используют его, чтобы наметить дизайн и макет работы в целом, не вникая в детали. Это первый этап процесса проектирования, который впоследствии будет доработан и дополнен деталями. Вайрфрейм описывает структуру страницы или мобильного приложения. Он помогает дизайнерам определить, где должны располагаться определенные элементы и как будет выглядеть дизайн в целом. В рамках структуры дизайнерам также необходимо спланировать, где будут располагаться элементы страницы — это называется информационной архитектурой. Дизайнеры могут определять расположение этих элементов в структуре страницы.",
			"published_at": "03.11.2024"
		},
		{
			"id": "004",
			"title": "Нетворкинг: как он делает из нас лучших программистов",
			"image_url": "https://fastly.picsum.photos/id/48/384/240.jpg?hmac=otG7ysG0i_E8RZofIDM22h6Ag9Bu56q9t3hfC5VpNyI",
			"content": "В современном мире нетворкинг стал неотъемлемой частью бизнеса и личного развития. В особенности для айтишников и программистов, которые работают в динамичной и постоянно меняющейся сфере, важно быть в курсе последних тенденций и иметь широкий круг профессиональных знакомств. В этой статье мы рассмотрим преимущества нетворкинга для айтишников и программистов и представим основные события, на которых они могут расширить свой круг знакомств и получить новые знания. Один из главных преимуществ нетворкинга для айтишников и программистов — это возможность познакомиться с коллегами из своей области, а также с представителями других компаний и отраслей. Это может привести к новым возможностям для сотрудничества, обмену опытом и знаниями, а также карьерному росту. Нетворкинг может помочь айтишникам и программистам найти новые возможности для работы или бизнеса. На мероприятиях, связанных с нетворкингом, можно познакомиться с представителями компаний, которые ищут новых сотрудников или партнёров для сотрудничества. Нетворкинг может помочь айтишникам и программистам продвинуть свою карьеру или развить свой бизнес. Знакомства с другими специалистами и представителями компаний могут привести к новым возможностям для роста и развития. Посещайте конференции и выставки — это мероприятия, на которых собираются представители отрасли, чтобы обсудить последние тенденции и новые технологии. Конференции и выставки могут быть как местными, так и международными. Вступайте в бизнес-сообщества — организации, объединяющие предпринимателей и бизнесменов для обмена опытом, знаниями и установления деловых контактов. Бизнес-сообщества также предоставляют своим участникам доступ к эксклюзивной информации, обучению и консультациям от экспертов в различных областях бизнеса. ",
			"published_at": "06.11.2024"
		},
		{
			"id": "005",
			"title": "Наши топ 10 JavaScript-фреймворков",
			"image_url": "https://fastly.picsum.photos/id/96/384/240.jpg?hmac=MET_sKMdlVXooUEkasN5BIwrVIYs5cGNQ7kOmTqR4TI",
			"content": "В мире фронтенд-разработки существует множество различных фреймворков, которые помогают сделать процесс создания веб-приложений более удобным и эффективным. Я являюсь частью этого мира уже более 4-х лет, сейчас занимаю должность фронтенд разработчика в топ-1 компании по разработке корпоративного софта, Loyalty Labs. За все время в IT я познакомилась с разными инструментами и фреймворками, и хотела бы обсудить трёх 'гигантов' в области frontend: React, Angular и Vue. Эта статья не предназначена для того, чтобы обучать вас этим фреймворкам. Это не технический гайд. Здесь я поделюсь своим мнением, попытаюсь разобраться в особенностях и понять, чем каждый из этих 'гигантов' может гордиться. Когда я была начинающим разработчиком, мне было сложно определиться с тем, что изучать. Я знала, что мне предстоит освоить стандартный набор инструментов: HTML, CSS и JavaScript. Ну а что ещё нужно фронтенд-разработчику на первый взгляд? Погружаясь в мир фронтенд-разработки, я узнала о существовании JavaScript-фреймворков, которые упрощают создание приложений. Прочитав множество статей о самых популярных, я всё никак не могла понять, чем один лучше другого, почему разработчики изучают эти фреймворки на уровне нового языка. На моём обучающем курсе нам рассказывали о Vue, он и стал моим первым фреймворком для первого SPA. Понять почему преподаватели выбрали именно его мне тогда не удалось, ведь я также слышала о популярности других инструментов - Angular и React. На сегодняшний день эти три фреймворка остаются наиболее популярными среди разработчиков и востребованными среди работодателей. В этой статье я хочу помочь тем, кто только начинает погружение в мир фронтенд-разработки и задумывается о том, какой фреймворк выбрать. Я постараюсь выделить ключевые особенности и сильные стороны каждого из этих трёх 'гигантов', чтобы показать, чем они могут быть полезны и привлекательны для разработчиков.",
			"published_at": "09.11.2024"
		},
		{
			"id": "006",
			"title": "Подкаст: создание лучшего CX Community",
			"image_url": "https://fastly.picsum.photos/id/5/384/240.jpg?hmac=_rNedbjj4lKw9JGoA12xlKzPAV3OM1Cy2OK44K1oiPc",
			"content": "По данным исследования Forrester, 72% компаний утверждают, что улучшение клиентского опыта (CX, customer eXperience) является для них приоритетным направлением. Но только 1% из них добились в этом значительных успехов. Между тем, отслеживание и измерение клиентского опыта — это один из основных способов улучшить его. Вице-президент по стратегическим исследованиям в UserTesting Джанэль Эстес отмечает: «Мы наблюдаем значительные изменения в отношении руководителей к клиентскому опыту. Те, кто предоставляет лучший CX, вкладывают много сил и средств в то, чтобы сделать клиента центром любого принимаемого решения».",
			"published_at": "12.11.2024"
		}
	],
	"comments": [
		{
			"id": "001",
			"author_id": "001",
			"post_id": "001",
			"content": "Отличная статья! Уолш часто использовал личные примеры, чтобы вдохновить команду. Я тоже вдохновляюсь им :)"
		}
	]
}
